from FallenMusic import BOT_NAME

PM_START_TEXT = """
ꜱᴀʟᴀᴍ {0},ᴍƏɴɪᴍ ᴀᴅɪᴍ {1}.

──────────────────
ᴍƏɴ ʙƏᴢɪ ꜰᴀʏᴅᴀʟɪ xÜꜱᴜꜱɪʏʏƏᴛʟƏʀɪ ᴏʟᴀɴ ᴛᴇʟᴇQʀᴀᴍ ʏᴀʏɪᴍ ᴠƏ ᴛᴀɢ ʙᴏᴛᴜʏᴀᴍ.

📡 ᴍƏɴɪ Qʀᴜᴘʟᴀʀɪɴɪᴢᴀ ƏʟᴀᴠƏ ᴇᴛᴍƏᴋᴅƏɴ ÇƏᴋɪɴᴍƏʏɪɴ

"""

START_TEXT = """
Salam {0}
{1} İɴᴅɪ ᴍᴀʜɴɪ ᴏxᴜʏᴀ ʙɪʟƏʀ {2}.

──────────────────
➻ ᴍƏɴɪᴍ ʜᴀQQɪᴍᴅᴀ ᴋÖᴍƏᴋ ᴇᴛᴍƏᴋ ÜÇÜɴ ᴠƏ ʏᴀ ʙɪʀ Şᴇʏ ꜱᴏʀᴜŞᴍᴀQ ɪꜱᴛƏʏɪʀꜱɪɴɪᴢꜱƏ, ᴍƏɴɪᴍ [Dəstək Çatıma]({3}) QᴏŞᴜʟᴀ ʙɪʟƏʀꜱɪɴɪᴢ.
"""

HELP_TEXT = f"""
<u>❄ **İꜱᴛɪꜰᴀᴅƏÇɪʟƏʀ ÜÇÜɴ ᴍÖᴠᴄᴜᴅ ƏᴍʀʟƏʀ {BOT_NAME} :**</u>

•━━━━━━━━•••━━━━━━━━•
๏ /play : ꜱƏꜱʟɪ Çᴀᴛᴅᴀ ᴍᴜꜱɪQɪ ʙᴀŞʟᴀᴅɪʀ.
๏ /pause : ᴄᴀʀɪ İꜰᴀʏᴀ ꜰᴀꜱɪʟƏ ᴠᴇʀɪʀ.
๏ /resume : ᴅᴀʏᴀɴᴅɪʀɪʟᴍɪŞ ʏᴀʏɪᴍɪ ᴅᴀᴠᴀᴍ ᴇᴛᴅɪʀɪɴ.
๏ /skip : ᴄᴀʀɪ İꜰᴀ ᴀxɪɴɪɴɪ ᴀᴛʟᴀʏɪɴ ᴠƏ ɴÖᴠʙƏᴅƏ ᴏʟᴀɴ ᴛʀᴇᴋɪ ʏᴀʏɪᴍʟᴀᴍᴀĞᴀ ʙᴀŞʟᴀʏᴀʀ.
๏ /end : ᴄᴀʀɪ İꜰᴀ ᴀxɪɴɪɴɪ ʙɪᴛɪʀƏʀ.
๏ /ping : ʙᴏᴛᴜɴ ᴘɪɴɢ ᴠƏ ꜱɪꜱᴛᴇᴍ ꜱᴛᴀᴛɪꜱᴛɪᴋᴀꜱɪɴɪ ɢÖꜱᴛƏʀɪʀ.
๏ /sudolist : ʙᴏᴛᴜɴ ꜱᴏᴅᴏ ɪꜱᴛɪꜰᴀᴅƏÇɪʟƏʀɪɴɪɴ ꜱɪʏᴀʜɪꜱɪɴɪ ɢÖꜱᴛƏʀɪʀ.
๏ /song : İꜱᴛƏᴅɪʏɪɴɪᴢ ᴍᴀʜɴɪɴɪ ʏÜᴋʟƏʏɪʀ ᴠƏ ꜱɪᴢƏ ɢÖɴᴅƏʀɪʀ.
๏ /search : ᴠᴇʀɪʟƏɴ ꜱᴏʀĞᴜɴᴜ ʏᴏᴜᴛᴜʙᴇ-ᴅᴀ ᴀxᴛᴀʀɪʀ ᴠƏ ɴƏᴛɪᴄƏɴɪ ꜱɪᴢƏ ɢÖꜱᴛƏʀɪʀ.
•━━━━━━━━•••━━━━━━━━•
"""

HELP_SUDO = f"""
<u>✨ **ꜱᴜᴅᴏ ƏᴍʀʟƏʀɪ ᴅᴀxɪʟ ᴏʟᴜʀ {BOT_NAME} :**</u>

•━━━━━━━━•••━━━━━━━━•
๏ /activevc : ʜᴀᴢɪʀᴅᴀ ᴀᴋᴛɪᴠ ꜱƏꜱʟɪ ꜱÖʜʙƏᴛʟƏʀɪɴ ꜱɪʏᴀʜɪꜱɪɴɪ ɢÖꜱᴛƏʀɪʀ.
๏ /eval və ya /sh : ᴠᴇʀɪʟᴍɪŞ ᴋᴏᴅᴜ ʙᴏᴛ ᴛᴇʀᴍɪɴᴀʟɪɴᴅᴀ ɪŞʟƏᴅɪʀ.
๏ /speedtest : ʙᴏᴛʟᴀʀ ꜱᴇʀᴠᴇʀɪɴᴅƏ ꜱÜʀƏᴛ ᴛᴇꜱᴛɪɴɪ ʜƏʏᴀᴛᴀ ᴋᴇÇɪʀɪʀ.
๏ /sysstats : ʙᴏᴛʟᴀʀ ꜱᴇʀᴠᴇʀɪɴɪɴ ꜱɪꜱᴛᴇᴍ ꜱᴛᴀᴛɪꜱᴛɪᴋᴀꜱɪɴɪ ɢÖꜱᴛƏʀɪʀ.
๏ /setname [ᴍƏᴛɴ ᴠƏ ʏᴀ ᴍƏᴛɴƏ ᴄᴀᴠᴀʙ] : ᴋÖᴍƏᴋÇɪ ʜᴇꜱᴀʙɪɴɪɴ ᴀᴅɪɴɪ ᴅƏʏɪŞᴅɪʀɪɴ.
๏ /setbio [ᴍƏᴛɴ ᴠƏ ʏᴀ ᴍƏᴛɴƏ ᴄᴀᴠᴀʙ] : ᴋÖᴍƏᴋÇɪ ʜᴇꜱᴀʙɪɴɪɴ ʙɪᴏ-ɴᴜ ᴅƏʏɪŞᴅɪʀɪɴ.
๏ /setpfp [ꜰᴏᴛᴏʏᴀ ᴄᴀᴠᴀʙ ᴠᴇʀɪɴ] : ᴋÖᴍƏᴋÇɪ ʜᴇꜱᴀʙɪɴɪɴ ᴘꜰᴘ-ɴɪ ᴅƏʏɪŞᴅɪʀɪɴ.
๏ /delpfp : ᴋÖᴍƏᴋÇɪ ʜᴇꜱᴀʙɪɴɪɴ ᴄᴀʀɪ ᴘꜰᴘ-ɴɪ ꜱɪʟɪɴ.
•━━━━━━━━•••━━━━━━━━•
"""

HELP_DEV = f"""
<u>✨ **ꜱᴀʜɪʙ Əᴍʀ ᴠᴇʀɪʀ {BOT_NAME} :**</u>

•━━━━━━━━•••━━━━━━━━•
๏ /config : ʙᴏᴛᴜɴ ʙÜᴛÜɴ ᴋᴏɴꜰɪQᴜʀᴀꜱɪʏᴀ ᴅƏʏɪŞƏɴʟƏʀɪɴɪ ƏʟᴅƏ ᴇᴛᴍƏᴋ ÜÇÜɴ.
๏ /broadcast: [ᴍᴇꜱᴀᴊ ɢÖɴᴅƏʀɪɴ ᴠƏ ʏᴀ ᴍᴇꜱᴀᴊᴀ ᴄᴀᴠᴀʙ ᴠᴇʀɪɴ] : ᴍᴇꜱᴀᴊɪ ʙᴏᴛᴜɴ xɪᴅᴍƏᴛ ᴇᴅɪʟƏɴ Çᴀᴛʟᴀʀɪɴᴀ Çᴀᴛᴅɪʀɪɴ.
๏ /rmdownloads :ʙᴏᴛʟᴀʀ ꜱᴇʀᴠᴇʀɪɴᴅƏ ʏÜᴋʟƏɴᴍɪŞ ᴋᴇŞ ꜰᴀʏʟʟᴀʀɪɴɪ ᴛƏᴍɪᴢʟƏʏɪʀ.
๏ /leaveall : ᴋÖᴍƏᴋÇɪ ʜᴇꜱᴀʙɪɴᴀ ʙÜᴛÜɴ ꜱÖʜʙƏᴛʟƏʀɪ ᴛƏʀᴋ ᴇᴛᴍƏʏɪ Əᴍʀ ᴇᴅɪʀ.
๏ /addsudo : [İꜱᴛɪꜰᴀᴅƏÇɪ ᴀᴅɪ ᴠƏ ʏᴀ ɪꜱᴛɪꜰᴀᴅƏÇɪʏƏ ᴄᴀᴠᴀʙ] : İꜱᴛɪꜰᴀᴅƏÇɪɴɪ ꜱᴜᴅᴏ ᴜꜱᴇʀꜱ ʟɪꜱʀ-Ə ƏʟᴀᴠƏ ᴇᴅɪɴ.
๏ /rmsudo : [İꜱᴛɪꜰᴀᴅƏÇɪ ᴀᴅɪ ᴠƏ ʏᴀ ɪꜱᴛɪꜰᴀᴅƏÇɪʏƏ ᴄᴀᴠᴀʙ] : İꜱᴛɪꜰᴀᴅƏÇɪɴɪ ꜱᴜᴅᴏ ɪꜱᴛɪꜰᴀᴅƏÇɪʟƏʀɪ ꜱɪʏᴀʜɪꜱɪɴᴅᴀɴ Çɪxᴀʀɪɴ..
•━━━━━━━━•••━━━━━━━━•
"""
TAG_MSJ = f"""
•━━━━━━━━•••━━━━━━━━•
**“📚 ƏᴍʀʟƏʀ„ ʙᴜɴʟᴀʀᴅɪʀ.⤵**
•━━━━━━━━•••━━━━━━━━•
**㋡⇰ /tag “ꜱƏʙƏʙ„ - 5-ʟɪ ᴛᴀɢ ᴀᴛɪŞʟᴀʀɪ.**
**㋡⇰ /etag “ꜱƏʙƏʙ„ - ᴇᴍᴏᴊɪ ɪʟƏ ᴇᴛɪᴋᴇᴛʟƏʀ.**
**㋡⇰ /stag “ꜱƏʙƏʙ„ - ꜱÖᴢ'ʟÜ ᴛᴀɢ ᴇᴛɪᴋᴇᴛʟƏʀ.**
**㋡⇰ /tektag “ꜱƏʙƏʙ„ - ÜᴢᴠʟƏʀɪ ᴛƏᴋ-ᴛƏᴋ ᴇᴛɪᴋᴇᴛʟƏʀ.**
**㋡⇰ /ctag “ꜱƏʙƏʙ„ - ᴄÜᴍʟᴇ ɪʟᴇ  ᴇᴛɪᴋᴇᴛʟƏʀ.**
**㋡⇰ /admins “ꜱƏʙƏʙ„ - İᴅᴀʀƏÇɪʟƏʀ ᴛƏᴋ-ᴛƏᴋ ᴇᴛɪᴋᴇᴛʟƏʀ.**
**㋡⇰ /cancel - ᴛᴀɢ ƏʟƏᴍƏʏɪ ᴅᴀʏᴀɴᴅɪʀ.**
•━━━━━━━━•••━━━━━━━━•
"""
